WebPrograming/Project/views/table/action.php



$this->title = 'События';
$users = Action::find()->orderBy('id')->all();
$types = Type::find()->orderBy('id')->all();
$bases = Bases::find()->orderBy('id')->all();
---
SELECT * FROM `action` ORDER BY `id`
SELECT * FROM `type` ORDER BY `id`
SELECT * FROM `bases` ORDER BY `id`

    <?php
     $action = ActiveForm::begin(['id' => 'contact-form']); ?>

     <?= $action->field($model, 'type')->dropdownList(
    Type::find()->select(['name', 'id'])->indexBy('name')->column())->label('Тип события');?>

     <?= $action->field($model, 'base')->dropdownList(
    Bases::find()->select(['name', 'id'])->indexBy('name')->column())->label('База');?>
---
SELECT `name`, `id` FROM `type`
SELECT `name`, `id` FROM `bases`