WebPrograming/Project/views/table/bases.php

SELECT * FROM `bases` ORDER BY `id`
---
use yii\grid\GridView;

$this->title = 'Базы';
$users = Bases::find()->orderBy('id')->all();