WebPrograming/Project/views/table/fields_done.php

use yii\grid\GridView;

$this->title = 'Сделаные поля';
$users = Fields_done::find()->orderBy('id')->all();
---
SELECT * FROM `fields_done` ORDER BY `id`

     $fields_done = ActiveForm::begin(['id' => 'contact-form']); ?>
     <? ?>

    <?= $fields_done->field($model1, 'base')->textInput()->dropdownList(Bases::find()->select(['name', 'id'])->indexBy('name')->column())->label('База');?>


    <?= $fields_done->field($model1, 'field')->textInput()->dropdownList(
    Fields::find()->select(['place', 'id'])->indexBy('place')->column())->label('Поле');?>

    <?= $fields_done->field($model1, 'amount')->textInput()->label('Количество cделанных гектар'); ?>

    <?= $fields_done->field($model1, 'type')->textInput()->dropdownList(
    Type::find()->select(['name', 'id'])->indexBy('name')->column())->label('Тип работ');?>

    <?= $fields_done->field($model1, 'who')->textInput()->dropdownList(
    Workers::find()->select(['surname', 'id'])->indexBy('surname')->column())->label('Работник');?>

    <?= $fields_done->field($model1, 'technic')->textInput()->dropdownList(
    Technics::find()->select(['name', 'id'])->indexBy('name')->column())->label('Техника');?>
---
SELECT `name`, `id` FROM `bases`
SELECT `place`, `id` FROM `fields`
SELECT `name`, `id` FROM `type`
SELECT `surname`, `id` FROM `workers`
SELECT `name`, `id` FROM `technics`