WebPrograming/Project/views/table/fields.php



$this->title = 'Поля';
$users = Fields::find()->orderBy('id')->all();
---
SELECT * FROM `fields` ORDER BY `id`


    <?= $fields->field($model, 'number_field')->textInput(['autofocus' => true])->label('Номер поля'); ?>

    <?= $fields->field($model, 'base')->textInput()->dropdownList(
    Bases::find()->select(['name', 'id'])->indexBy('name')->column())->label('База');?>
---
SELECT `name`, `id` FROM `bases`