WebPrograming/Project/views/table/fuel_on_base.php



$this->title = 'Топливо на базе';
$users = Fuel_on_base::find()->orderBy('id')->all();
---
SELECT * FROM `fuel_on_base` ORDER BY `id`

     $fuel_on_base = ActiveForm::begin(['id' => 'contact-form']) ?>
     <?= $fuel_on_base->field($model, 'id') ?>
    <?= $fuel_on_base->field($model, 'amount')->label('Количество') ?>
    <?= $fuel_on_base->field($model, 'base')->dropdownList(
    Bases::find()->select(['name', 'id'])->indexBy('name')->column())->label('База'); ?>
---
SELECT `name`, `id` FROM `bases`