WebPrograming/Project/views/table/fuel_on_baseedit.php

SELECT `name`, `id` FROM `bases`
---
$form = ActiveForm::begin(['layout' => 'horizontal']) ?>
    <?= $form->field($model, 'id') ?>
    <?= $form->field($model, 'amount')->label('Количество') ?>
    <?= $form->field($model, 'base')->dropdownList(
    Bases::find()->select(['name', 'id'])->indexBy('name')->column())->label('База'); ?>