WebPrograming/Project/views/table/type.php



$this->title = 'Тип работ(действий)';
$users = Type::find()->orderBy('id')->all();
---
SELECT * FROM `type` ORDER BY `id`