WebPrograming/Project/views/table/users.php

SELECT * FROM `users` ORDER BY `id`
---


$this->title = 'Учасники';
$users = Users::find()->orderBy('id')->all();