WebPrograming/Project/models/UserIdentity.php

SELECT * FROM `users` WHERE `username`='admin'
---
    public static function findByUsername($username)
    {
         return static::findOne(['username' => $username]);