WebPrograming/Project/controllers/TableController.php

SELECT * FROM `fuel_on_base` WHERE `id`='2'
UPDATE `fuel_on_base` SET `amount`=11, `base`='Цвіля' WHERE `id`=2
---
    public function actionUpdatefuel_on_base($id)
    {
        $model = Fuel_on_base::findOne($id);
        if($model->load(Yii::$app->request->post())){
            $model->save();

SELECT * FROM `fuel_on_base` WHERE `id`='2'
DELETE FROM `fuel_on_base` WHERE `id`=2
---
    public function actionDeletefuel_on_base($id)
    {
        $model = Fuel_on_base::findOne($id);
        if($model)
            $model->delete();

INSERT INTO `fuel_on_base` (`amount`, `base`) VALUES (11, 'Покалів')
---
    public function actionFuel_on_base()
    {
        if(!Yii::$app->user->isGuest){
       $dataProvider = new ActiveDataProvider([
    'query' => Fuel_on_base::find(),
    'pagination' => [
        'pageSize' => 20,
    ],
    ]);
        $model = new Fuel_on_baseForm();
        if ($model->load(Yii::$app->request->post())) {

        if($model->save())

SELECT * FROM `type` WHERE `id`='7'
UPDATE `type` SET `name`='78' WHERE `id`=7
---
    public function actionUpdatetype($id)
    {
        $model = Type::findOne($id);
        if($model->load(Yii::$app->request->post())){
            $model->save();

SELECT * FROM `type` WHERE `id`='7'
DELETE FROM `type` WHERE `id`=7
---
    public function actionDeletetype($id)
    {
        $model = Type::findOne($id);
        if($model)
            $model->delete();

INSERT INTO `type` (`name`) VALUES ('rfc')
---
    public function actionType()
    {
        if(!Yii::$app->user->isGuest){
       $dataProvider = new ActiveDataProvider([
    'query' => Type::find(),
    'pagination' => [
        'pageSize' => 20,
    ],
    ]);
        $model = new TypeForm();
        if ($model->load(Yii::$app->request->post())) {

        if($model->save())